// Напишите программу, которая будет преобразовывать десятичное число в двоичное

Console.WriteLine("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());

while (num > 0)
{
    num % 2
}