// Напишите программу, которая на вход принимает число и выдает, является ли число четным(делится на два без остатка).

Console.Write("Введите число: ");
int numberA = Convert.ToInt32(Console.ReadLine());
    if (numberA % 2 == 0)
    Console.WriteLine(" Четное");
    else 
    Console.WriteLine(" Нечетное");

