// Напишите программу, которая принимает на вход число и выдает количество цифр в числе

Console.WriteLine("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
int count = 0;
for (int i = 0; )